<?php
$API_KEY = '6954308615:AAGR_Am6TDdcT1C-vYWcb4dQAvlFBpRQFYM';//tokon rbttn ro inja jiy gzry knid
$channel = "@addyou10"; //ID channel bdne @
$admin = '175706993'; //ID addy admin ro Kingsimple.php set webhook anjm bdid
?>
/*
سورس هک اینستا ورژن 1.2

این سورس توسط👇

@Lactive

نوشته شده است ..

آیدی چنلمون برای دریافت دیگر سورس ها👇

@Kingsimple

عضو بشید سورس های جدید میزاریم که تو کانال های دیگه نمیتونید پیدا کنید ..

شمایی که این سورس رو میزاری تو چنلت حتما منبعی که ازش بر میداری رو بزار چون روش وقت و زحمت رفته دوست عزیز

کپی فقط با ذکر منبع غیر این صورت شرعا حرام است دوست گلم ..
*/
